Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [DEV-319] empty fields aren't shown in hosts inventory
ja: [DEV-319] ホストインベントリで空白のフィールドは表示しないように修正

source: Added SNMPv3 based discovery checks.
ja: SNMPv3によるディスカバリチェック機能の追加。

source: improved inheritance of template graphs
ja: テンプレートのグラフの継承を改善

source: Added support of negative floating point numbers.
ja: マイナスの浮動小数値を利用することができます。

source: [ZBX-2799] fixed map element host in maintenance
ja: [ZBX-2799] メンテナンス中のマップのホストのアイコンを修正

source: [ZBX-2414] added PHP session module check as requirement in dashboard and installation
ja: [ZBX-2414] ダッシュボードやインストール画面のシステム要求にPHPセッションモジュールのチェックを追加

source: [DEV-333] fixed possible server crash while processing remote commands
ja: [DEV-333] リモートコマンド処理でサーバクラッシュする可能性がある問題を修正

source: [ZBX-1242] fixed adding macro in triggers editing form
ja: [ZBX-1242] トリガー編集フォームのマクロ追加機能を修正

source: [ZBX-4159] fixed frontend incorrectly handle new ids for history tables in distributed setup
ja: [ZBX-4159] 分散監視環境でヒストリテーブルの新しいidsの誤った処理を修正

source: Advanced ICMP based monitoring
ja: ICMPベースの監視の改善

source: [ZBX-4198] fixed items filter when filter by host name with multiple spaces
ja: [ZBX-4198] 複数のスペースを含むホスト名を利用したアイテムのフィルタリングを修正

source: more informative report for configuration script
ja: 設定スクリプトにより詳細な情報を表示

source: [ZBX-533] fixed incorrect SNMP string to float conversion
ja: [ZBX-533] SNMP文字列を数値へ変換する処理の間違いを修正

source: [ZBX-1912] fixed nonstandard font vertical text display
ja: [ZBX-1912] 非標準のフォントを縦書きで表示したときに正しく表示されない問題を修正

source: [ZBXNEXT-377] added support of passive mode for proxies
ja: [ZBXNEXT-377] プロキシにパッシブモードを追加

source: [ZBX-3469] fixed setting UNKNOWN trigger status when agent goes down
ja: [ZBX-3469] エージェントがダウンした際にトリガーの状態が不明に設定されていたのを修正

source: [ZBX-856] fixed email sending if tcp packets from smtp server are segmented
ja: [ZBX-856] SMTPサーバからのTCPパケットが分割されている場合のメール送信を修正

source: [ZBX-183] fixed compilation problem with undefined res_query()
ja: [ZBX-183] コンパイル時のres_query()未定義の問題を修正

source: 9 September 2011
ja: 2011年9月9日

source: [ZBX-1030] fixed security vulnerability in server allowing remote unauthenticated users to execute scripts.
ja: [ZBX-1030] Zabbixサーバが認証されていないユーザからのスクリプト実行を許可してしまうセキュリティ脆弱性を修正

source: ZABBIX Forums (http://www.zabbix.com/forum)
ja: ZABBIXフォーラム (http://www.zabbix.com/forum)

source: [ZBX-2829] fixed web item graphs favourites
ja: [ZBX-2829] お気に入りのWebアイテムのグラフを修正

source: [ZBX-1054] fixed processing of logs and eventlogs which become empty only on the agent side
ja: [ZBX-1054] ログやイベントログが空になった場合のエージェント側の処理を修正

source: More scripts can be added and configured.
ja: その他にもスクリプトを追加、設定することができます。

source: Multiplier after delta
ja: 増分計算後の乗数計算

source: It was replaced by a new more efficient, yet simple, schema working on the level of user groups and host groups.
ja: より効率的かつシンプルにユーザグループとホストグループを管理できるスキーマに変更されています。

source: fixed compilation problem under Solaris
ja: Solaris上でのコンパイルの問題を修正

source: [ZBX-3659] API exists() methods now return true/false instead of true/error
ja: [ZBX-3659] APIのexists()メソッドがtrue/errorの代わりにtrue/falseを返すように変更

source: You may take advantage of a commercial SMS provider for reliable messaging in the US and Canada.
ja: アメリカとカナダにおいて信頼性の高いメッセージ送信のために商用のSMSプロバイダを活用することができます。

source: [ZBX-1050] fixed possible windows agent crash while processing big eventlog records
ja: [ZBX-1050] 大きなイベントログレコードの処理中にWindowsエージェントがクラッシュする可能性がある問題を修正

source: [ZBX-2326] fixed XSS vulnerability in triggers page; later independently discovered by VUPEN Security
ja: [ZBX-2326] トリガー画面のXSS脆弱性を修正 (後にVUPEN Securityより広報された問題)

source: Minor improvements could be introduced.
ja: 小さな改善が行われる可能性があります。

source: [ZBX-2738] fixed problems with Ukrainian locales
ja: [ZBX-2738] ウクライナ語利用時の問題を修正

source: Added support network and disk stats under OpenBSD
ja: OpenBSDのネットワークとディスクステータスの監視機能を追加

source: [ZBX-855] fixed processing of eventlogs timestamps on server side
ja: [ZBX-855] サーバ側のイベントログのタイムスタンプの処理を修正

source: [DEV-137] DM: improved performance of historical data synchronization
ja: [DEV-137] 分散モニタリング: ヒストリデータの同期のパフォーマンスを改善

source: [ZBX-3514] fixed log trigger wizard
ja: [ZBX-3514] ログトリガーウィザードを修正

source: [ZBX-1604] extended maintenance period info messages
ja: [ZBX-1604] メンテナンス期間の情報メッセージを拡張

source: You won't miss any serious issue anymore!
ja: これにより重要な障害を見落とさないようになりました！

source: This document contains the release notes for Zabbix 1.8.4rc1.
ja: このドキュメントはZabbix 1.8.4rc1のリリースノートを含みます。

source: [ZBXNEXT-326] more efficient synchronization of configuration data
ja: [ZBXNEXT-326] 設定データの同期を効率化

source: [ZBX-1798] updated Russian translation; thanks to dotneft
ja: [ZBX-1798] ロシア語訳の更新; dotneftに感謝

source: [DEV-137] fixed incorrect comment for TrapperTimeout option in zabbix_server.conf
ja: [DEV-137] zabbix_server.confのTrapperTimeoutの間違ったコメントを修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.6rc2 (Second Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.6rc2 (2番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: Not recommended for large setups due to inefficient locking mehanism.
ja: ロッキングメカニズムの効率が悪いことから、大規模なシステムには推奨されません。

source: Thanks to Joseph Womack.
ja: Joseph Womackに感謝

source: [ZBX-1055] fixed DBexecute function result with PostreSQL
ja: [ZBX-1055] PostgreSQLのDBexecute関数を修正

source: [ZBX-356] fixed possible server crash for non *log() items with type 'log'
ja: [ZBX-356] *log()ではないアイテムにログタイプを指定した場合にサーバがクラッシュする可能性がある問題を修正

source: [ZBX-495] fixed DB upgrade script when doing 1.1->1.4->1.6
ja: [ZBX-495] 1.1->1.4->1.6とアップデートした場合のアップグレードスクリプトの問題を修正

source: This document contains the release notes for Zabbix 1.8.7rc1.
ja: このドキュメントはZabbix 1.8.7rc1のリリースノートを含みます。

source: ZABBIX Windows agent supports Windows Vista, both 32 and 64 bit versions.
ja: ZABBIX WindowsエージェントはWindows Vista(32/64bit)をサポートします

source: Please use it in a test environment and report any issues to Zabbix Bug Tracking system at https://support.zabbix.com.
ja: テスト環境で利用して問題があった場合はZABBIXバグトラッキングシステムhttps://support.zabbix.comに問題の報告をお願いします。

source: Execute a database patch if migrating from Zabbix 1.8.x.
ja: Zabbix 1.8.xからマイグレーションする場合はデータベースのパッチ適用を行ってください。

source: Added Support of UTF-8
ja: UTF-8のサポートを追加

source: [ZBX-596] fixed support of IPV6 under Windows 2000
ja: [ZBX-596] Windows2000のIPv6のサポートの修正

source: fixed SQL problem in Configuration->Graphs, all graphs selected
ja: 設定->グラフですべてのグラフを選択した際のSQLの問題を修正

source: The choice of action calculation algorithm was introduced.
ja: アクションの計算アルゴリズムを選択可能

source: [ZBX-1441] fixed incorrectly remembered link line type
ja: [ZBX-1441] リンクの線のタイプを誤って記憶する問題を修正

source: [ZBXNEXT-288] improved server performance by not storing function lastvalue in database
ja: [ZBXNEXT-288] データベースにlastvalueを保存しないことによりサーバ性能を改善

source: [ZBX-925] fixed verification of IPv6 adresses in frontend
ja: [ZBX-925] フロントエンドのIPv6アドレスの検証を修正

source: [ZBXNEXT-321] decreased number of selects from DB while processing trends data
ja: [ZBXNEXT-321] DBからトレンドデータを処理する際のselect文の数を削減

source: [ZBXNEXT-293] processes now provide more information on why they terminate
ja: [ZBXNEXT-293] プロセスが終了した原因をより詳細に出力するように修正

source: fixed agent library dependencies
ja: エージェントのライブラリ依存関係を修正

source: events duration now counts weeks instead of months, small GUI typos fix
ja: イベント期間の単位の月を週に修正。GUIの小さな表記間違いを修正。

source: The screens are available via Monitoring->Hosts, yet the form is not finished yet.
ja: [監視データ]→[ホスト]画面でスクリーンを表示することができます。まだフォームは完全に実装できていません。

source: Remote commands accept all macros supported by notifications.
ja: リモートコマンドは通知に利用できるすべてのマクロをサポートします。

source: [ZBX-3503] fixed "incorrect usage of quotes" error
ja: [ZBX-3503] "クォートの使い方が間違っています"エラーを修正

source: Installation
ja: インストール

source: [ZBX-946] fixed drawing trigger line in graphs with trigger function "avg"
ja: [ZBX-946] トリガーの関数に「avg」を使用した場合の、グラフのトリガーの線の描画を修正

source: [ZBX-2083] fixed audit.details field cutting
ja: [ZBX-2083] audit.detailsフィールドが切れてしまっていた問題を修正

source: Advanced cache module
ja: キャッシュモジュールの改善

source: [ZBX-2664] fixed viewed period and filter status reset in web monitoring
ja: [ZBX-2664] Web監視で表示期間とフィルター状態がリセットされる問題を修正

source: [ZBX-379] added error checking for accept on server side
ja: [ZBX-379] サーバ側の受信エラーチェック処理を追加

source: fixed problem with adding the graphs on an autodiscovered hosts
ja: オートディスカバリで発見されたホストに対するグラフの追加の問題を修正

source: [ZBX-1580] reduced frontend memory usage
ja: [ZBX-1580] フロントエンドのメモリ使用量を削減

source: ZABBIX 1.3.x is currently in a feature freeze.
ja: ZABBIX 1.3.xは現在フィーチャーフリーズ期間です。

source: [DEV-377] improved global search
ja: [DEV-377] グローバル検索を改善

source: [ZBX-4203] fixed API trigger.update method removes dependencies
ja: [ZBX-4203] APIのtrigger.updateメソッドが依存関係を削除する問題を修正

source: [ZBXNEXT-612] added mapname URL parameter for monitoring->maps
ja: [ZBXNEXT-612] 監視データ->マップ画面にマップ名で指定できるURLパラメータを追加

source: Zabbix SIA is proud to announce the availability of Zabbix 1.9.4 (Fifth Alpha Release of Zabbix 2.0).
ja: Zabbix SIAはZabbix 1.9.4 (Zabbix 2.0の5番目のアルファリリース)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-116] fixed typo in data.sql, "interfice"
ja: [ZBX-116] data.sql中の「interfice」表記間違いを修正

source: ZABBIX distributed monitoring is made for complex environments consisting of different locations.
ja: ZABBIXの分散モニタリングは異なる場所にある複数の環境を監視することができます。

source: [ZBX-2737] fixed various messages at linking templates
ja: [ZBX-2737] テンプレートのリンクに関するいくつかのメッセージを修正

source: [DEV-137] changed the minimal maintenance time from 1 hour to 5 minutes
ja: [DEV-137] 最小のメンテナンス期間を1時間から5分に変更

source: [ZBX-2306] fixed zoom position
ja: [ZBX-2306] グラフの拡大表示(zoom)の位置を修正

source: [ZBX-1626] added LDAP authentication to API
ja: [ZBX-1626] APIにLDAP認証を追加

source: fixed iregexp()
ja: iregexp()の修正

source: [ZBX-130] added refresh of unsupported active checks
ja: [ZBX-130] サポートされてないアクティブチェックのリフレッシュ機能を追加

source: New media type, Jabber, can be used to send messages to Jabber network (Google Talk, other).
ja: 新しいメディアタイプJabberはGoogle TalkなどのJabberネットワークにメッセージを送ることができます。

source: [ZBX-3070] fixed event date format inconsistency
ja: [ZBX-3070] イベントの日付フォーマットの矛盾を修正

source: It is very handy for monitoring of Cloud-like environments.
ja: クラウド環境を監視のために非常に便利に使うことができます。

source: [ZBX-76] added number of members in host groups
ja: [ZBX-76] ホストグループにメンバーの数を追加

source: ListenIP is supported by Windows agent.
ja: Windowsエージェントの設定パラメータにListenIPを利用することができます。

source: This document contains release notes for ZABBIX 1.5.2.
ja: このドキュメントはZABBIX 1.5.2のリリースノートを含みます。

source: Yes, stacked graphs!
ja: グラフをスタックさせることができます

source: [ZBX-982] fixed message when can't delete application with web items
ja: [ZBX-982] Webアイテムを持つアプリケーションが削除できなかったときのメッセージを修正

source: This document contains release notes for ZABBIX 1.5.1.
ja: このドキュメントはZABBIX 1.5.1のリリースノートを含みます。

source: [ZBX-1346] improve example configuration files
ja: [ZBX-1346] サンプル設定ファイルを改善

source: See also details on ZABBIX Proxy.
ja: 詳細はZABBIXプロキシの項を参照してください。

source: [ZBX-1283] fixed group selection in maintenance edit form
ja: [ZBX-1283] メンテナンス編集画面のグループ選択を修正

source: [ZBX-2844] added HTML escaping of screen names in combox box output in monitoring
ja: [ZBX-2844] 監視データ画面のスクリーン名のHTMLにエスケープを追加

source: [ZBX-3768] fixed 'uptime' and 's' units as according to the documentation
ja: [ZBX-3768] 'uptime'と単位's'の処理をマニュアルに合わせるように修正

source: Adde ability to force configuration cache reload of a running server and proxy, which, in the case of active proxy, will also force config re-read from the server.
ja: 動作中のZabbixサーバやZabbixプロキシの設定情報のキャッシュを強制的に再読み込みする機能を追加しました。アクティブプロキシにおいてもZabbixサーバから強制的に設定を再読み込みさせることができます。

source: Encryption
ja: 暗号化

source: [ZBX-77] fixes for refreshing pages in Monitoring
ja: [ZBX-77] 監視データ画面のページのリフレッシュ処理を修正

source: improved performance of the graph related screen due to missing index
ja: インデックスの欠如によるグラフ関連の画面のパフォーマンスを修正

source: [ZBX-3] remove a comment saying syslog is used until it works
ja: [ZBX-3] 実装が完了するまでsyslogが利用されますというコメントを削除

source: [ZBX-3673] fixed processing of operators & and | in trigger and calculated items expressions
ja: [ZBX-3673] トリガーと計算アイテムの条件式の演算子 & と | の処理を修正

source: [ZBX-2457] changed "type" to "ENGINE" in MySQL upgrade patches for MySQL 5.5 compatibility
ja: [ZBX-2457] MySQL 5.5互換のためにMySQLアップグレードパッチの「type」を「ENGINE」に変更

source: New item check type, external, can be used to enchance functionality of ZABBIX server by writing a custom scripts.
ja: アイテムの新しいチェックタイプであるexternalは、カスタムスクリプトを書くことによってZABBIXサーバーの機能を拡張することができます。

source: Complete List of Bug Fixes and Improvements included into 1.8.6
ja: 1.8.6に含まれるすべてのバグフィックスと改善の一覧

source: Complete List of Bug Fixes and Improvements included into 1.8.8
ja: 1.8.8に含まれるすべてのバグフィックスと改善の一覧

source: [ZBXNEXT-782] added support of not-supported items in the history cache
ja: [ZBXNEXT-782] ヒストリキャッシュ内でサポートされていなかったアイテムのサポートを追加

source: Complete List of Bug Fixes and Improvements included into 1.8.9
ja: 1.8.9に含まれるすべてのバグフィックスと改善の一覧

source: [ZBX-3341] fixed host export - valuemap property is now exported as expected
ja: [ZBX-3341] 値のマッピングをエクスポートできるようホストのエクスポートを修正

source: fixed wrong caption for graph item editing form
ja: グラフアイテムの編集フォームの誤った見出しを修正

source: improved performance of ZABBIX Proxy module
ja: ZABBIXプロキシモジュールのパフォーマンスを改善

source: [ZBX-2900] added spaces to "From:" and "To:" email headers
ja: [ZBX-2900] メールヘッダの「From:」と「To:」にスペースを追加

source: Added sorting for all screens
ja: すべての画面のソート機能

source: New supported checks
ja: 新しく利用できるチェック機能

source: Support of auto-registration
ja: 自動登録のサポート

source: New login screen
ja: 新しいログイン画面

source: [ZBX-3515] fixed names of SNMPv3 security levels, again
ja: [ZBX-3515] SNMPv3セキュリティレベルの名前を再修正

source: [ZBX-985] fixed pgsql return value
ja: [ZBX-985] pgsqlの返り値を修正

source: [ZBX-2121] events from Windows eventlog with type 'EVENTLOG_SUCCESS' are treated as 'Information' in Zabbix as in Windows
ja: [ZBX-2121] 「EVENTLOG_SUCCESS」WindowsイベントログをWindowsと同様にZabbixでも「情報」として扱うように修正

source: [ZBX-1623] fixed no proxy listed when admin edits host
ja: [ZBX-1623] 管理者のホスト編集時にプロキシが表示されない問題を修正

source: Changed API search wildcard
ja: APIの検索ワイルドカードを変更

source: A new command line option enables reading of performance and availability data from standard input.
ja: 標準入力からパフォーマンス情報や動作状況を読み込むためのコマンドラインオプションが追加されました。

source: [ZBX-2251] removed error displaying in area of graphics
ja: [ZBX-2251] グラフ領域で表示されるエラーを削除

source: Servers and network devices can be monitored using Telnet or secure SSH connections.
ja: TelnetやセキュアSSH接続を利用してサーバやネットワーク機器を監視することができます。

source: Added more flexibility to scripts
ja: より柔軟性のあるスクリプト

source: Zabbix server processes require much less memory.
ja: Zabbixサーバプロセスはより少ないメモリで動作します。

source: It is recommended to upgrade from previous releases of 1.6.x.
ja: このリリースはZABBIX 1.6.xの以前のリリースからアップグレードすることを推奨します。

source: [ZBX-2950] added popup menus for map elements
ja: [ZBX-2950] マップのアイコンにポップアップメニューを追加

source: [ZBX-3040] guest users now can't edit trigger comments
ja: [ZBX-3040] ゲストユーザがトリガーコメントを編集できないように修正

source: This document contains the release notes for Zabbix 1.8.4rc3.
ja: このドキュメントはZabbix 1.8.4rc3のリリースノートを含みます。

source: Plenty of other improvements
ja: その他の多数の改善

source: [ZBX-4141] fixed possible hang of server/proxy processes after unsuccessful execution of a SQL statement
ja: [ZBX-4141] SQL文の実行が失敗した場合にサーバ/プロキシプロセスがハングアップする可能性がある問題を修正

source: [ZBX-3253] added schema selection for db2 setup and a configuration file parameter on the server
ja: [ZBX-3253] DB2セットアップのためのスキーマとサーバの設定ファイルのパラメータを追加

source: Support of Oracle will be restored in later releases.
ja: Oracleのサポートは今後のリリースで行う予定です。

source: added Queue view for proxies
ja: プロキシ用のキューのビューを追加

source: [ZBX-824] fixed net.tcp.service to work with host DNS name
ja: [ZBX-824] net.tcp.serviceをホストのDNS名で動作するように修正

source: [DEV-434] added support of host availability for proxy hosts
ja: [DEV-434] プロキシホスト利用時のエージェントの稼働状態のサポートを追加

source: [ZBX-3676] fixed item selection in bar report
ja: [ZBX-3676] バーレポートのアイテム選択時の問題を修正

source: [ZBX-1869] fixed graph max Y most top value calculation
ja: [ZBX-1869] グラフのY軸の最大値の計算を修正

source: This document contains release notes for ZABBIX 1.5.4.
ja: このドキュメントはZABBIX 1.5.4のリリースノートを含みます。

source: [ZBX-3050] fixed that host can be named like an existing template and otherwise
ja: [ZBX-3050] すでに存在しているテンプレートやその他のホストと同じホスト名を設定できる問題を修正

source: [ZBXNEXT-192] added possibility to exclude some services from the result of services[]
ja: [ZBXNEXT-192] services[]の結果からいくつかのサービスを除外する機能を追加

source: fixed frontend vulnerabilities
ja: Webインターフェースの脆弱性を修正

source: [ZBX-450] fixed showing status of items in maps for non english locale
ja: [ZBX-450] 英語以外の言語でマップ内のアイテムのステータス表示を修正

source: This is the first release in a series of pre-1.8 releases.
ja: このリリースは1.8の開発版の最初のリリースです。

source: [DEV-430] added map labels macro {TRIGGERS.UNACK}
ja: [DEV-430] ラベル用マクロ{TRIGGERS.UNACK}を追加

source: [ZBX-428] added internal check zabbix[requiredperformance]
ja: [ZBX-428] インターナルチェックzabbix[requiredperformance]を追加

source: [ZBX-2634] fixed instability of Zabbix processes on Solaris due to them crashing in signal handlers
ja: [ZBX-2634] Solaris上のZabbixプロセスがシグナルハンドラでクラッシュするために不安定な問題を修正

source: [DEV-385] added Event ID field for eventlogs
ja: [DEV-385] イベントログにイベントIDのフィールドを追加

source: [ZBX-2733] fixed the timer process so that it does not recalculate extraneous triggers for an item
ja: [ZBX-2733] 同じアイテムに設定された無関係なトリガーの再計算を行わないようにタイマープロセスを修正

source: [ZBX-952] increased max length of processed text and log data to 64KB
ja: [ZBX-952] テキストおよびログデータの処理の最大長を64KBまで拡張

source: WEB monitoring module supports basic authentication.
ja: Web監視モジュールでベーシック認証を使用することができます。

source: This document contains the release notes for Zabbix 1.8.4rc4.
ja: このドキュメントはZabbix 1.8.4rc4のリリースノートを含みます。

source: [ZBX-504] fixed date selector issue for log items in latest values screen
ja: [ZBX-504] 最新データの画面のログアイテムの日付セレクタの問題を修正

source: [ZBX-940] fixed bug with not initialized array variable
ja: [ZBX-940] 配列変数が初期化されないバグを修正

source: [ZBXNEXT-373] added support for NTLM authentication to Web monitoring
ja: [ZBXNEXT-373] Web監視にNTLM認証のサポートを追加

source: Modification and creation of screens was simplified by adding support of drag-and-drop and new edit options.
ja: ドラッグアンドドロップによる操作や新しい設定オプションにより、スクリーンの編集と作成がより簡単に行えるようになりました。

source: [ZBXNEXT-146] added support of numeric values with plus sign
ja: [ZBXNEXT-146] 数値にプラス記号を利用できるように修正

source: [ZBX-2189] fixed compilation under AIX 5.3
ja: [ZBX-2189] AIX 5.3上でコンパイルの問題を修正

source: improved item graph exporting
ja: グラフのエクスポートを改善

source: This document contains release notes for ZABBIX 1.5.3.
ja: このドキュメントはZABBIX 1.5.3のリリースノートを含みます。

source: This release introduces functionality for distributed monitoring.
ja: このリリースでは、分散モニタリングの機能が追加されています。

source: [ZBX-983] fixed error when updating trigger
ja: [ZBX-983] トリガー更新時のエラーを修正

source: This document contains the release notes for Zabbix 1.8.
ja: このドキュメントはZabbix 1.8のリリースノートを含みます。

source: [ZBX-2351] fixed server trying to insert duplicate eventids into the database
ja: [ZBX-2351] Zabbixサーバがデータベースに重複したイベントIDをインサート使用とする問題を修正

source: [ZBX-719] fixed typo in default graph title
ja: [ZBX-719] デフォルトのグラフタイトルの表記間違いを修正

source: [ZBX-3068] fixed possible crash of server while processing passive proxies
ja: [ZBX-3068] パッシブプロキシの処理中にサーバがクラッシュする可能性がある問題を修正

source: Zabbix server processes requires much less memory.
ja: Zabbixサーバプロセスはより少ないメモリで動作します。

source: added tooltip in "status of ZABBIX" report for number of items and triggers parameter
ja: 「ZABBIXサーバの状態」画面のアイテムとトリガーのパラメータ数にツールチップを追加

source: [ZBX-882] fixed template linkage form
ja: [ZBX-882] テンプレートのリンクフォームを修正

source: [ZBX-2747] improved sql when saving triggers
ja: [ZBX-2747] トリガーを保存時のSQLを改善

source: fixed problem with lost actions when upgrading database to 1.6.x
ja: データベースを1.6.xにアップグレードした際にアクションが消失する問題を修正

source: [ZBX-733] added checks on value map creation/update
ja: [ZBX-733] マップの作成/更新に値のチェック機能を追加

source: [ZBX-3880] fixed repeated processing of log-files through proxy when disabling a host or item
ja: [ZBX-3880] ホストやアイテムを無効にした時にプロキシ経由のログファイルの処理が繰り返してしまう問題を修正

source: [ZBX-820] fixed updating downstream item applications when upstream item is updated without changing applications
ja: [ZBX-820] テンプレート側でアプリケーションを変更しないでアイテムを更新した場合に、継承先のアイテムのアプリケーションが更新される問題を修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.6rc1 (First Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.6rc1 (1番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2913] fixed timeout handling in processing of web.page.* checks
ja: [ZBX-2913] web.page.*チェックの処理中のタイムアウトのハンドリングを修正

source: The release supports MySQL, PostgreSQL and SQLite only.
ja: このリリースではMySQL、PostgreSQL、SQLiteのみサポートされます。

source: fixed "Invalid URL" error when choose History from history submenu
ja: ヒストリのサブメニューからヒストリを選択した際の「無効なURL」を修正

source: Support of PHP 5.3
ja: PHP 5.3のサポート

source: fixed error when try to remove trigger comment
ja: トリガーのコメントを削除する際のエラーを修正

source: [ZBX-3453] improve performance of cpu collector
ja: [ZBX-3453] CPU関連の情報収集処理のパフォーマンスを改善

source: Optional graph legends
ja: グラフの凡例オプション

source: Complete List of Bug Fixes and Improvements included into 1.8.9rc1
ja: 1.8.9rc1に含まれるすべてのバグフィックスと改善の一覧

source: Enhanced auto-discovery
ja: オートディスカバリの強化

source: Support of global notifications
ja: グローバル通知機能の追加

source: [ZBX-1392] fixed representing of Uptime/Downtime times and child discovered devices in STATUS OF DISCOVERY screen
ja: [ZBX-1392] ディスカバリのステータス画面のアップタイム/ダウンタイム時間と発見されたデバイスの配下の表示の問題を修正

source: [ZBX-967] cosmetic changes in --help output of zabbix_get and zabbix_sender
ja: [ZBX-967] zabbix_getとzabbix_senderの--helpの出力の体裁を変更

source: New XML based import/export allows manipulation with hosts, items and triggers making it an excellent choice for sharing common templates.
ja: 新しいXMLベースのインポート/エクスポート機能は、ホスト、アイテム、トリガーのテンプレートの共有に役立ちます。

source: Remote JMX monitoring
ja: リモートJMX監視

source: [ZBX-1372] applied patches for localization
ja: [ZBX-1372] 翻訳用のパッチを適用

source: fixed Wrong URL when add rights to user group
ja: ユーザグループに権限を追加する際の間違ったURLを修正

source: The release does not fix support of PostgreSQL.
ja: このリリースではPostgreSQLのサポートを修正していません。

source: [DEV-406] added milliseconds to log files of all Zabbix daemon processes
ja: [DEV-406] 全てのZabbixデーモンプロセスのログファイルにミリ秒を追加

source: [ZBX-3030] fixed event durations in monitoring
ja: [ZBX-3030] 監視データのイベントの継続期間を修正

source: Improved performance of ZABBIX server
ja: ZABBIXサーバのパフォーマンスの改善

source: [ZBX-763] fixed warning message displayed at the bottom when saving graphs without items
ja: [ZBX-763] アイテムがない状態でグラフを保存した際に下部に表示されるワーニングメッセージを修正

source: See http://www.zabbix.com/forum/showthread.php?t=14315 for more details.
ja: より詳細な情報はhttp://www.zabbix.com/forum/showthread.php?t=14315を参照してください。

source: Added support of update interval in icmpping* simpe checks
ja: icmpping*シンプルチェックに更新間隔の設定機能を追加

source: changed installation directory to '$sbin'
ja: インストールディレクトリを$sbinに変更

source: Note that agents are available pre-compiled from http://www.zabbix.com/download.php for a limited number of versions and platforms.
ja: 一部のプラットフォームとバージョンに限られますが、コンパイル済みのエージェントをhttp://www.zabbix.com/download.phpからダウンロードすることができます。

source: [ZBX-2233] fixed processing of action condition 'Trigger <>'
ja: [ZBX-2233] アクションのコンディションの「トリガー <>」の処理の問題を修正

source: [ZBXNEXT-538] added support for IBM DB2
ja: [ZBXNEXT-538] IBM DB2のサポートを追加

source: New after-login greeting message
ja: 新しいログイン後のグリーティングメッセージ

source: [ZBX-2419] fixed calculation of SLA if uptime/downtime is specified
ja: [ZBX-2419] アップタイム/ダウンタイムが指定された場合のSLAの計算を修正

source: [ZBX-1999] fixed bug when cannot create simple check item with macro in parameters
ja: [ZBX-1999] パラメータにマクロを使用したシンプルチェックを作成することができないバグを修正

source: [ZBX-3076] disabled generation of events in case if some items or hosts in trigger expression are not active
ja: [ZBX-3076] トリガー条件式内のいくつかのアイテムやホストが無効の場合にイベントを生成しないように修正

source: added support of zabbix[uptime] and zabbix[boottime]
ja: zabbix[uptime]とzabbix[boottime]を追加
